cases/ansys_verification/VMFL076-R2/case/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;
boundaryField
{
    inlet   { type fixedValue; value uniform 300; }
    outlet  { type zeroGradient; }
    top     { type inletOutlet; inletValue uniform 300; value uniform 300; }
    plate   { type fixedValue; value uniform 350; }
    frontAndBack { type empty; }
}
